In [1]:
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import numpy as np
from sklearn.linear_model import LinearRegression
from sklearn.preprocessing import OneHotEncoder,StandardScaler
from sklearn.model_selection import train_test_split
from sklearn.compose import make_column_transformer
from sklearn.pipeline import make_pipeline
from sklearn.metrics import r2_score

In [2]:
df = pd.read_csv('Kerala_house_Shylesh.csv')
df.head()

        location    size  total_sqft  bath     Price
0  Jawahar Nagar  4 BHK         2700     5  40000000
1     Vanchiyoor  5 BHK         3500     5  27500000
2     Vanchiyoor  5 BHK         3700     5  27500000
3        Kowdiar  3 BHK         1650     4   8000000
4         Pattom  4 BHK         3800     4  32500000

In [3]:
df.tail()

          location    size  total_sqft  bath     Price
1192     Thirumala  5 BHK         2800     5  14500000
1193     Thirumala  4 BHK         2100     4   8500000
1194  Vayalilkkada  4 BHK         3300     5  24500000
1195   Kariavattom  5 BHK         3795     5  21000000
1196  Kazhakoottam  3 BHK         1500     3   6900000

In [4]:
df1=df['location'].value_counts()
df1
df1.to_csv("count1.csv")

In [5]:
'''df1 = pd.read_csv('Count.csv')
# selecting rows based on condition 
rslt_df = df1[df1['Count'] < 10] 
    
print('\nResult dataframe :\n', rslt_df['location'])
'''

"df1 = pd.read_csv('Count.csv')\n# selecting rows based on condition \nrslt_df = df1[df1['Count'] < 10] \n    \nprint('\nResult dataframe :\n', rslt_df['location'])\n"

In [6]:
df.shape

(1197, 5)

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1197 entries, 0 to 1196
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   location    1197 non-null   object
 1   size        1197 non-null   object
 2   total_sqft  1197 non-null   int64
 3   bath        1197 non-null   int64
 4   Price       1197 non-null   int64
dtypes: int64(3), object(2)
memory usage: 46.9+ KB

In [8]:
#Cleaning

In [9]:
backup=df.copy()

In [10]:
df.isnull().sum()

location      0
size          0
total_sqft    0
bath          0
Price         0
dtype: int64

In [11]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1197 entries, 0 to 1196
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   location    1197 non-null   object
 1   size        1197 non-null   object
 2   total_sqft  1197 non-null   int64
 3   bath        1197 non-null   int64
 4   Price       1197 non-null   int64
dtypes: int64(3), object(2)
memory usage: 46.9+ KB

In [12]:
for column in df.columns:
     print(df[column].value_counts())

Kowdiar            91
Pattom             86
Thirumala          82
Kesavadasapuram    45
Karamana           34
                   ..
Sasthamangalam      1
Attingal            1
Ptp nagar           1
Mukkola             1
Kudappanakunnu      1
Name: location, Length: 165, dtype: int64
4 BHK     351
3 BHK     295
5 BHK     182
2 BHK     119
3 BHK     108
4 BHK      75
2 BHK      23
5 BHK      23
1 BHK      10
6 BHK       5
7 BHK       3
8 BHK       2
1 BHK       1
Name: size, dtype: int64
2000    62
2500    58
3500    53
1500    52
1800    51
        ..
4635     1
6120     1
3438     1
5946     1
1050     1
Name: total_sqft, Length: 215, dtype: int64
3    391
4    354
5    216
2    148
1     54
0     27
6      5
7      1
8      1
Name: bath, dtype: int64
7500000    48
7000000    46
9500000    41
8500000    38
6500000    29
           ..
450000      1
4430000     1
6350000     1
4350000     1
8400000     1
Name: Price, Length: 161, dtype: int64

In [13]:
df.describe()

         total_sqft         bath         Price
count   1197.000000  1197.000000  1.197000e+03
mean    2523.011696     3.395155  1.310208e+07
std     2163.581452     1.200645  2.283695e+07
min        0.000000     0.000000  1.400000e+05
25%     1500.000000     3.000000  6.000000e+06
50%     2000.000000     3.000000  8.300000e+06
75%     3000.000000     4.000000  1.500000e+07
max    35000.000000     8.000000  4.430000e+08

In [14]:
df['location'].value_counts()

Kowdiar            91
Pattom             86
Thirumala          82
Kesavadasapuram    45
Karamana           34
                   ..
Sasthamangalam      1
Attingal            1
Ptp nagar           1
Mukkola             1
Kudappanakunnu      1
Name: location, Length: 165, dtype: int64

In [15]:
df['size'].value_counts()

4 BHK     351
3 BHK     295
5 BHK     182
2 BHK     119
3 BHK     108
4 BHK      75
2 BHK      23
5 BHK      23
1 BHK      10
6 BHK       5
7 BHK       3
8 BHK       2
1 BHK       1
Name: size, dtype: int64

In [16]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1197 entries, 0 to 1196
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   location    1197 non-null   object
 1   size        1197 non-null   object
 2   total_sqft  1197 non-null   int64
 3   bath        1197 non-null   int64
 4   Price       1197 non-null   int64
dtypes: int64(3), object(2)
memory usage: 46.9+ KB

In [17]:
df['Price']=df['Price'].astype(str)

In [18]:
df=df[df['Price'].str.isnumeric()]

In [19]:
df['Price']=df['Price'].str.replace(',','').astype(float)

In [20]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1197 entries, 0 to 1196
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   location    1197 non-null   object
 1   size        1197 non-null   object
 2   total_sqft  1197 non-null   int64
 3   bath        1197 non-null   int64
 4   Price       1197 non-null   float64
dtypes: float64(1), int64(2), object(2)
memory usage: 56.1+ KB

In [21]:
df['bhk']=df['size'].str.split().str.get(0).astype(int)

In [22]:
df.describe()

         total_sqft         bath         Price          bhk
count   1197.000000  1197.000000  1.197000e+03  1197.000000
mean    2523.011696     3.395155  1.310208e+07     3.592314
std     2163.581452     1.200645  2.283695e+07     0.982731
min        0.000000     0.000000  1.400000e+05     1.000000
25%     1500.000000     3.000000  6.000000e+06     3.000000
50%     2000.000000     3.000000  8.300000e+06     4.000000
75%     3000.000000     4.000000  1.500000e+07     4.000000
max    35000.000000     8.000000  4.430000e+08     8.000000

In [23]:
df

           location    size  total_sqft  bath       Price  bhk
0     Jawahar Nagar  4 BHK         2700     5  40000000.0    4
1        Vanchiyoor  5 BHK         3500     5  27500000.0    5
2        Vanchiyoor  5 BHK         3700     5  27500000.0    5
3           Kowdiar  3 BHK         1650     4   8000000.0    3
4            Pattom  4 BHK         3800     4  32500000.0    4
...             ...     ...         ...   ...         ...  ...
1192      Thirumala  5 BHK         2800     5  14500000.0    5
1193      Thirumala  4 BHK         2100     4   8500000.0    4
1194   Vayalilkkada  4 BHK         3300     5  24500000.0    4
1195    Kariavattom  5 BHK         3795     5  21000000.0    5
1196   Kazhakoottam  3 BHK         1500     3   6900000.0    3

[1197 rows x 6 columns]

In [24]:
df['location'].value_counts()

Kowdiar            91
Pattom             86
Thirumala          82
Kesavadasapuram    45
Karamana           34
                   ..
Sasthamangalam      1
Attingal            1
Ptp nagar           1
Mukkola             1
Kudappanakunnu      1
Name: location, Length: 165, dtype: int64

In [25]:
df['location'] = df['location' ].apply(lambda x: x.strip())
location_counts = df ['location'].value_counts()

In [26]:
location_counts

Kowdiar            91
Pattom             86
Thirumala          82
Kesavadasapuram    45
Karamana           34
                   ..
Attingal            1
Ptp nagar           1
Muttada             1
Punnakulam          1
Kudappanakunnu      1
Name: location, Length: 163, dtype: int64

In [27]:
location_count_less_1 = location_counts[location_counts<=10]

In [28]:
df['location']=df['location'].apply(lambda x: 'other' if x in location_count_less_1 else x)
df['location'].value_counts()

other              438
Kowdiar             91
Pattom              86
Thirumala           82
Kesavadasapuram     45
Kazhakoottam        34
Karamana            34
Kumarapuram         34
Ulloor              33
Manacaud            28
Anayara             26
Thampanoor          26
Akkulam             25
Pongumoodu          20
Vattiyoorkavu       19
Thycaud             19
Vazhuthacaud        17
Vanchiyoor          17
Ambalamukku         17
Peroorkada          17
Karikkakam          14
Sreekaryam          14
Pattoor             14
Peyad               13
Attukal             12
Kuravankonam        11
Mannanthala         11
Name: location, dtype: int64

In [29]:
df.describe()

         total_sqft         bath         Price          bhk
count   1197.000000  1197.000000  1.197000e+03  1197.000000
mean    2523.011696     3.395155  1.310208e+07     3.592314
std     2163.581452     1.200645  2.283695e+07     0.982731
min        0.000000     0.000000  1.400000e+05     1.000000
25%     1500.000000     3.000000  6.000000e+06     3.000000
50%     2000.000000     3.000000  8.300000e+06     4.000000
75%     3000.000000     4.000000  1.500000e+07     4.000000
max    35000.000000     8.000000  4.430000e+08     8.000000

In [30]:
df['price_per_sqft']=df['Price']/df['total_sqft']

In [31]:
df['price_per_sqft']

0       14814.814815
1        7857.142857
2        7432.432432
3        4848.484848
4        8552.631579
            ...
1192     5178.571429
1193     4047.619048
1194     7424.242424
1195     5533.596838
1196     4600.000000
Name: price_per_sqft, Length: 1197, dtype: float64

In [32]:
df.describe()

         total_sqft         bath         Price          bhk  price_per_sqft
count   1197.000000  1197.000000  1.197000e+03  1197.000000     1197.000000
mean    2523.011696     3.395155  1.310208e+07     3.592314             inf
std     2163.581452     1.200645  2.283695e+07     0.982731             NaN
min        0.000000     0.000000  1.400000e+05     1.000000       56.000000
25%     1500.000000     3.000000  6.000000e+06     3.000000     3454.545455
50%     2000.000000     3.000000  8.300000e+06     4.000000     4640.000000
75%     3000.000000     4.000000  1.500000e+07     4.000000     6315.789474
max    35000.000000     8.000000  4.430000e+08     8.000000             inf

In [33]:
(df['total_sqft']/df['bhk']).describe()

count     1197.000000
mean       717.005223
std        718.328851
min          0.000000
25%        460.000000
50%        550.000000
75%        750.000000
max      13650.000000
dtype: float64

In [34]:
df=df[((df['total_sqft']/df['bhk'])>=200)]
df.describe()

         total_sqft         bath         Price          bhk  price_per_sqft
count   1181.000000  1181.000000  1.181000e+03  1181.000000     1181.000000
mean    2553.734124     3.408129  1.316303e+07     3.601185     5340.413395
std     2161.509596     1.195075  2.294514e+07     0.971264     4825.710696
min      450.000000     0.000000  1.400000e+05     1.000000       56.000000
25%     1500.000000     3.000000  6.000000e+06     3.000000     3444.444444
50%     2000.000000     3.000000  8.500000e+06     4.000000     4631.578947
75%     3000.000000     4.000000  1.500000e+07     4.000000     6250.000000
max    35000.000000     8.000000  4.430000e+08     8.000000   114285.714286

In [35]:
df.shape

(1181, 7)

In [36]:
df.price_per_sqft.describe()

count      1181.000000
mean       5340.413395
std        4825.710696
min          56.000000
25%        3444.444444
50%        4631.578947
75%        6250.000000
max      114285.714286
Name: price_per_sqft, dtype: float64

In [37]:
df.shape

(1181, 7)

In [38]:
df

          location    size  total_sqft  bath       Price  bhk  price_per_sqft
0            other  4 BHK         2700     5  40000000.0    4    14814.814815
1       Vanchiyoor  5 BHK         3500     5  27500000.0    5     7857.142857
2       Vanchiyoor  5 BHK         3700     5  27500000.0    5     7432.432432
3          Kowdiar  3 BHK         1650     4   8000000.0    3     4848.484848
4           Pattom  4 BHK         3800     4  32500000.0    4     8552.631579
...            ...     ...         ...   ...         ...  ...             ...
1192     Thirumala  5 BHK         2800     5  14500000.0    5     5178.571429
1193     Thirumala  4 BHK         2100     4   8500000.0    4     4047.619048
1194         other  4 BHK         3300     5  24500000.0    4     7424.242424
1195         other  5 BHK         3795     5  21000000.0    5     5533.596838
1196  Kazhakoottam  3 BHK         1500     3   6900000.0    3     4600.000000

[1181 rows x 7 columns]

In [39]:
df.drop(columns=['size','price_per_sqft'],inplace=True)

C:\Users\91892\AppData\Local\Temp\ipykernel_12268\1032069002.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df.drop(columns=['size','price_per_sqft'],inplace=True)

In [40]:
## Cleaned data

In [41]:
df.head()

     location  total_sqft  bath       Price  bhk
0       other        2700     5  40000000.0    4
1  Vanchiyoor        3500     5  27500000.0    5
2  Vanchiyoor        3700     5  27500000.0    5
3     Kowdiar        1650     4   8000000.0    3
4      Pattom        3800     4  32500000.0    4

In [42]:
df.to_csv("Cleaned_data_house.csv")

In [43]:
#model

In [44]:
X=df.drop(columns=['Price'])
y=df['Price']

In [45]:
X_train, X_test, y_train, y_test = train_test_split(X,y,test_size=0.25,random_state=2157)

In [46]:
print (X_train.shape)
print (X_test.shape)

(885, 4)
(296, 4)

In [47]:
column_trans=make_column_transformer((OneHotEncoder(sparse=False),['location']),remainder='passthrough')

In [48]:
scaler=StandardScaler()

In [49]:
lr=LinearRegression()

In [50]:
from sklearn.ensemble import RandomForestRegressor
rfr = RandomForestRegressor(n_estimators = 500, random_state = 0)

In [51]:
pipe1=make_pipeline(column_trans,scaler,lr)
pipe2=make_pipeline(column_trans,scaler,rfr)

In [52]:
pipe1.fit(X_train,y_train)

Pipeline(steps=[('columntransformer',
                 ColumnTransformer(remainder='passthrough',
                                   transformers=[('onehotencoder',
                                                  OneHotEncoder(sparse=False),
                                                  ['location'])])),
                ('standardscaler', StandardScaler()),
                ('linearregression', LinearRegression())])

In [53]:
pipe2.fit(X_train,y_train)

Pipeline(steps=[('columntransformer',
                 ColumnTransformer(remainder='passthrough',
                                   transformers=[('onehotencoder',
                                                  OneHotEncoder(sparse=False),
                                                  ['location'])])),
                ('standardscaler', StandardScaler()),
                ('randomforestregressor',
                 RandomForestRegressor(n_estimators=500, random_state=0))])

In [54]:
y_pred_lr=pipe1.predict(X_test)
y_pred_lr

array([ 5.04266877e+06,  6.22231677e+06,  6.54999677e+06,  7.72964477e+06,
        6.22231677e+06,  1.06132288e+07,  2.01159488e+07,  1.23827008e+07,
        5.23927677e+06,  1.13996608e+07,  2.70627648e+07,  4.19070077e+06,
        1.36934208e+07,  2.87998077e+06,  1.04821568e+07,  2.73249088e+07,
        1.21205568e+07,  9.56465277e+06,  7.53303677e+06,  1.76586877e+06,
        1.04821568e+07,  2.10989888e+07,  1.33657408e+07,  1.59216448e+07,
        1.40211008e+07,  2.19509568e+07,  1.27103808e+07,  1.15307328e+07,
        6.94321277e+06,  6.81214077e+06,  5.08523328e+07, -2.65747231e+05,
        2.21475648e+07,  5.82910077e+06,  2.97497408e+07,  2.05091648e+07,
        1.61837888e+07,  4.19070077e+06,  6.94321277e+06,  2.16232768e+07,
        2.23441728e+07,  8.12286077e+06,  2.18854208e+07,  1.98538048e+07,
        1.84120128e+07,  1.90018368e+07,  6.51756769e+05,  1.06132288e+07,
        2.10989888e+07,  1.78221888e+07,  1.70357568e+07,  5.56695677e+06,
        8.25393277e+06,  1.17273408e+07,  9.49911677e+06,  8.90929277e+06,
        1.46764608e+07,  1.19239488e+07,  1.58986733e+08,  1.29069888e+07,
        1.95916608e+07,  9.10590077e+06,  5.43588477e+06,  9.69572477e+06,
        1.29725248e+07,  1.07443008e+07,  2.16232768e+07,  7.79518077e+06,
        3.99409277e+06,  5.82910077e+06,  3.48615488e+07,  5.89463677e+06,
        7.99178877e+06, -3.31283231e+05,  1.46109248e+07,  2.12955968e+07,
        1.02200128e+07,  4.38730877e+06,  1.54628928e+07,  1.17273408e+07,
        2.37859648e+07,  5.10820477e+06,  1.24482368e+07,  1.37589568e+07,
        2.97497408e+07,  1.02200128e+07,  5.04266877e+06,  9.89233277e+06,
        5.43588477e+06,  3.92855677e+06,  1.99848768e+07,  8.71268477e+06,
        6.54999677e+06,  1.12030528e+07,  2.09354877e+06,  1.46109248e+07,
        7.99178877e+06,  1.17273408e+07,  4.97713277e+06,  6.22231677e+06,
        1.21205568e+07,  9.63018877e+06,  1.77566528e+07,  1.56595008e+07,
        8.51607677e+06,  1.67736128e+07,  6.81214077e+06,  8.64714877e+06,
        7.92625277e+06,  2.34582848e+07,  7.46750077e+06,  1.33002048e+07,
        1.55939648e+07,  9.95786877e+06,  1.50041408e+07,  1.63803968e+07,
        1.52662848e+07,  9.63018877e+06,  2.37859648e+07,  1.71668288e+07,
        2.16888128e+07,  5.37034877e+06,  7.86071677e+06,  8.84375677e+06,
        4.25623677e+06,  5.82910077e+06,  9.89233277e+06,  3.84660288e+07,
        3.18468928e+07,  2.89633088e+07,  8.84375677e+06,  2.85700928e+07,
        1.33002048e+07,  4.38730877e+06,  1.76586877e+06,  4.25623677e+06,
        1.19894848e+07,  8.58161277e+06,  1.43818877e+06,  1.63479677e+06,
        1.36934208e+07,  4.97713277e+06,  2.16232768e+07,  9.89233277e+06,
        1.33657408e+07,  1.97227328e+07,  3.99409277e+06,  2.58540769e+05,
        1.78221888e+07,  1.76911168e+07,  1.99848768e+07,  9.23697277e+06,
        1.27103808e+07,  9.56465277e+06,  8.25393277e+06,  4.38730877e+06,
        1.12030528e+07,  2.10334528e+07,  1.12030528e+07,  3.27319677e+06,
        1.40211008e+07,  1.97227328e+07,  1.49386048e+07,  8.90929277e+06,
        8.90929277e+06,  1.19894848e+07,  1.83464768e+07,  2.10334528e+07,
        1.17273408e+07,  3.66641277e+06,  5.56695677e+06,  1.27103808e+07,
        4.19070077e+06,  1.34312768e+07,  4.58391677e+06,  6.22231677e+06,
        1.11375168e+07,  1.74289728e+07,  2.44413248e+07,  1.02200128e+07,
        6.22231677e+06,  2.39170368e+07,  6.22231677e+06,  1.90673728e+07,
        2.42122877e+06,  1.25137728e+07,  1.78221888e+07,  1.70033277e+06,
        1.31035968e+07,  6.35338877e+06,  3.99409277e+06,  1.62493248e+07,
        6.61553277e+06,  2.54899008e+07,  9.36804477e+06,  9.89233277e+06,
        3.99409277e+06,  6.22231677e+06,  9.30250877e+06,  1.02200128e+07,
        7.53303677e+06,  1.06132288e+07,  1.81498688e+07,  1.99193408e+07,
        1.31691328e+07,  1.33657408e+07,  8.97482877e+06,  3.27319677e+06,
        2.47690048e+07,  1.30380608e+07,  1.13996608e+07,  4.86896448e+07,
        9.69572477e+06,  2.01159488e+07,  1.17273408e+07,  3.57790528e+07,
        9.89233277e+06,  1.00234048e+07,  4.58391677e+06,  9.89233277e+06,
        4.45284477e+06,  1.21205568e+07,  5.69802877e+06,  8.25393277e+06,
        1.06132288e+07,  2.29015677e+06,  1.11050877e+06,  2.87011648e+07,
        1.70357568e+07,  4.84606077e+06,  2.35238208e+07,  1.19894848e+07,
        1.44143168e+07,  5.69802877e+06,  1.06132288e+07,  3.99409277e+06,
        8.18839677e+06,  2.35893568e+07,  1.37589568e+07,  7.92625277e+06,
        1.17273408e+07,  2.37859648e+07,  1.89363008e+07,  7.40196477e+06,
        5.82910077e+06,  1.99193408e+07,  2.42122877e+06,  1.59216448e+07,
        2.23441728e+07,  2.44413248e+07,  8.97482877e+06,  6.54999677e+06,
        3.27319677e+06,  6.61553277e+06,  1.76586877e+06,  7.72964477e+06,
        1.03510848e+07,  1.14651968e+07,  1.51352128e+07,  9.63018877e+06,
        5.76356477e+06,  1.49386048e+07,  1.55284288e+07,  7.33642877e+06,
        7.00874877e+06,  1.41521728e+07,  1.93950528e+07,  2.48676477e+06,
        1.12030528e+07,  2.79802688e+07,  1.21205568e+07,  2.64074048e+07,
        7.72964477e+06,  1.40211008e+07,  2.68337277e+06,  2.23441728e+07,
        8.90929277e+06,  1.17273408e+07,  9.49911677e+06,  2.89633088e+07,
        1.95916608e+07,  9.82679677e+06,  7.53303677e+06,  4.91159677e+06,
        5.10820477e+06,  1.06132288e+07,  7.00874877e+06,  1.31035968e+07,
        1.67080768e+07,  3.07658877e+06,  8.05732477e+06,  1.33657408e+07,
        1.87396928e+07,  1.38900288e+07,  1.36278848e+07,  6.74660477e+06])

In [55]:
y_pred_rfr=pipe2.predict(X_test)
y_pred_rfr

array([7.22546121e+06, 8.04522310e+06, 9.08173667e+06, 1.03949006e+07,
       8.04522310e+06, 1.43780863e+07, 6.09620000e+06, 6.70620333e+06,
       6.68492524e+06, 5.71223333e+06, 1.01043500e+07, 3.40868000e+06,
       3.29167440e+07, 6.63349381e+06, 7.34035603e+06, 5.48120000e+06,
       1.03942286e+07, 1.30146100e+07, 1.01296771e+07, 7.42753382e+06,
       1.27413500e+07, 7.87460000e+06, 9.28429667e+06, 2.31072738e+07,
       8.34932143e+06, 2.51241974e+07, 1.62101333e+07, 8.77486286e+06,
       9.64529841e+06, 5.83577524e+06, 8.68740000e+06, 2.41110000e+06,
       2.86161967e+07, 1.68333507e+07, 2.54137464e+07, 2.94939167e+07,
       1.39745333e+07, 3.40868000e+06, 9.64529841e+06, 2.55925048e+07,
       2.35459655e+07, 5.67623357e+06, 2.91593048e+07, 5.60080000e+06,
       1.15603483e+07, 2.77821333e+07, 2.84800000e+06, 1.43780863e+07,
       3.08576119e+07, 2.17504200e+07, 1.60156667e+07, 4.73113590e+06,
       1.19953067e+07, 2.23174167e+07, 7.42380333e+06, 7.86304381e+06,
       5.18674119e+06, 8.85890000e+06, 3.03826100e+08, 8.11592857e+06,
       3.11859333e+07, 7.92327524e+06, 5.96151401e+06, 1.60001167e+07,
       8.75232000e+06, 1.36073400e+07, 2.55925048e+07, 4.46002673e+06,
       6.82356258e+06, 3.58825132e+06, 2.88478536e+07, 3.59530466e+06,
       1.17658651e+07, 1.56781333e+06, 1.18345595e+07, 2.67860419e+07,
       8.11128889e+06, 5.76972300e+06, 1.84508924e+07, 1.52290640e+07,
       6.75420000e+06, 8.05998167e+06, 1.11523743e+07, 1.08929143e+07,
       2.54137464e+07, 8.48570333e+06, 7.22546121e+06, 5.86194355e+06,
       5.96151401e+06, 3.62657333e+06, 2.49431837e+07, 7.19124585e+06,
       2.29546728e+07, 9.21370386e+06, 7.71756246e+06, 1.18345595e+07,
       6.10045222e+06, 1.52290640e+07, 6.36136389e+06, 8.04522310e+06,
       1.03942286e+07, 3.02440657e+07, 2.06151667e+07, 1.22138003e+07,
       5.09070000e+06, 1.77562667e+07, 7.58165635e+06, 1.23159764e+07,
       2.07241090e+07, 3.03767024e+07, 9.39484333e+06, 8.02955000e+06,
       1.67974000e+07, 1.17666800e+07, 1.29675635e+07, 2.24992571e+07,
       1.26835238e+07, 6.84876048e+06, 2.22967030e+07, 2.87420500e+07,
       2.42428538e+07, 4.81562000e+06, 8.26495000e+06, 4.03954952e+06,
       5.39218304e+06, 3.58825132e+06, 1.41012772e+07, 2.89332667e+07,
       1.48166544e+07, 2.55968500e+07, 4.03954952e+06, 9.74925000e+06,
       6.70407000e+06, 5.22930000e+06, 3.11871762e+06, 5.39218304e+06,
       1.43093011e+07, 1.57999143e+07, 3.08123333e+06, 7.26021952e+06,
       8.89780000e+06, 6.36136389e+06, 2.55925048e+07, 1.41012772e+07,
       9.28429667e+06, 3.80193190e+07, 6.78425903e+06, 3.57973357e+06,
       2.17504200e+07, 2.22179205e+07, 3.06506167e+07, 1.53146548e+07,
       1.62101333e+07, 8.47478667e+06, 6.80850167e+06, 5.76972300e+06,
       5.71950000e+06, 2.96347762e+07, 9.21370386e+06, 5.34990190e+06,
       2.53766802e+07, 3.80193190e+07, 1.32380314e+07, 1.10260152e+07,
       7.62161007e+06, 1.14316000e+07, 1.24824024e+07, 2.96347762e+07,
       1.52290640e+07, 6.02184063e+06, 8.24616873e+06, 7.26964000e+06,
       2.87790000e+06, 8.53963286e+06, 7.02661333e+06, 7.76965932e+06,
       7.73085889e+06, 1.75991424e+07, 3.20532119e+07, 6.80636000e+06,
       7.76965932e+06, 2.62235101e+07, 7.76965932e+06, 2.31557600e+07,
       7.01995714e+06, 7.77270000e+06, 2.17504200e+07, 8.96214079e+06,
       1.12669619e+07, 7.27950574e+06, 6.78425903e+06, 1.30376405e+07,
       8.48304762e+06, 4.47831000e+06, 9.67505667e+06, 1.41012772e+07,
       6.82356258e+06, 7.76965932e+06, 1.00683759e+07, 8.10818942e+06,
       6.96181204e+06, 7.67043960e+06, 6.70832000e+06, 2.79292103e+07,
       5.53095152e+06, 9.28429667e+06, 8.39830000e+06, 5.92396848e+06,
       2.93746000e+07, 1.38497100e+07, 1.52927486e+07, 8.05420000e+06,
       1.60001167e+07, 2.45146000e+07, 2.23174167e+07, 8.76185000e+06,
       1.41012772e+07, 9.37443548e+06, 6.90677337e+06, 1.41012772e+07,
       3.23730000e+06, 1.03942286e+07, 5.58946667e+06, 6.98340000e+06,
       1.43780863e+07, 6.73695651e+06, 6.66645518e+06, 8.17495000e+06,
       9.80920000e+06, 5.80461857e+06, 1.50174000e+07, 7.48424000e+06,
       2.07778960e+07, 7.75242183e+06, 9.29080000e+06, 7.30418381e+06,
       1.52540211e+07, 2.55772898e+07, 1.08929143e+07, 7.07051000e+06,
       8.61558905e+06, 2.22967030e+07, 1.69712667e+07, 8.54042048e+06,
       3.58825132e+06, 2.79292103e+07, 7.01995714e+06, 1.35055400e+07,
       2.35459655e+07, 2.58514000e+07, 8.39830000e+06, 4.52036333e+06,
       5.34990190e+06, 8.48304762e+06, 7.42753382e+06, 1.03949006e+07,
       1.24500633e+07, 6.28744000e+06, 2.47515452e+07, 6.84876048e+06,
       5.84017773e+06, 9.48117333e+06, 5.29480000e+06, 5.51033857e+06,
       5.06975222e+06, 1.04433463e+07, 2.41989614e+07, 6.53612127e+06,
       2.16283139e+07, 2.34983786e+07, 1.03942286e+07, 6.81320000e+06,
       1.03949006e+07, 4.78402000e+06, 5.70087857e+06, 2.35459655e+07,
       7.62161007e+06, 1.27888267e+07, 5.24679095e+06, 2.55968500e+07,
       3.11859333e+07, 5.14825905e+06, 6.96181204e+06, 4.72713000e+06,
       7.06764725e+06, 7.59854638e+06, 5.06975222e+06, 2.63184655e+07,
       1.41961510e+07, 2.00374405e+06, 2.32120650e+07, 9.17791667e+06,
       1.95652167e+07, 1.38841845e+07, 8.39072000e+06, 4.84846667e+06])

In [56]:
print("Linear regression:",r2_score(y_test,y_pred_lr))
print("RandomForest regression",r2_score(y_test,y_pred_rfr))

Linear regression: 0.5563782310704741
RandomForest regression 0.8893962519477803

In [57]:
'''scores=[]
for i in range(10000):
    X_train,X_test,y_train,y_test=train_test_split(X,y,test_size=0.25,random_state=i)
    lr=LinearRegression()
    pipe=make_pipeline(column_trans,scaler,lr)
    pipe.fit(X_train,y_train)
    y_pred=pipe.predict(X_test)
    scores.append(r2_score(y_test,y_pred))'''

'scores=[]\nfor i in range(10000):\n    X_train,X_test,y_train,y_test=train_test_split(X,y,test_size=0.25,random_state=i)\n    lr=LinearRegression()\n    pipe=make_pipeline(column_trans,scaler,lr)\n    pipe.fit(X_train,y_train)\n    y_pred=pipe.predict(X_test)\n    scores.append(r2_score(y_test,y_pred))'

In [58]:
#np.argmax(scores)

In [59]:
#scores[np.argmax(scores)]

In [60]:
import pickle

In [61]:
pickle.dump (pipe2,open('RandomForestRegression.pkl','wb'))

In [62]:
pipe2.predict(pd.DataFrame([['Kowdiar',1850,4,4]],columns=['location','total_sqft','bhk','bath']))

array([8705853.33333333])